sapphireos/chromatron/src/hal/sams70/arm/sams70a/include/component/dacc.h
#define DACC_TRIGR_TRGEN_Pos                0                                              /**< (DACC_TRIGR Position) Trigger Enable of Channel x */
#define DACC_TRIGR_TRGEN_Msk                (_U_(0x3) << DACC_TRIGR_TRGEN_Pos)             /**< (DACC_TRIGR Mask) TRGEN */
#define DACC_TRIGR_TRGEN(value)             (DACC_TRIGR_TRGEN_Msk & ((value) << DACC_TRIGR_TRGEN_Pos))  

/* -------- DACC_CHER : (DACC Offset: 0x10) (/W 32) Channel Enable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CH0:1;                     /**< bit:      0  Channel 0 Enable                         */
    uint32_t CH1:1;                     /**< bit:      1  Channel 1 Enable                         */
    uint32_t :30;                       /**< bit:  2..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t CH:2;                      /**< bit:   0..1  Channel x Enable                         */
    uint32_t :30;                       /**< bit:  2..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} DACC_CHER_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DACC_CHER_OFFSET                    (0x10)                                        /**<  (DACC_CHER) Channel Enable Register  Offset */

#define DACC_CHER_CH0_Pos                   0                                              /**< (DACC_CHER) Channel 0 Enable Position */
#define DACC_CHER_CH0_Msk                   (_U_(0x1) << DACC_CHER_CH0_Pos)                /**< (DACC_CHER) Channel 0 Enable Mask */
#define DACC_CHER_CH0                       DACC_CHER_CH0_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_CHER_CH0_Msk instead */
#define DACC_CHER_CH1_Pos                   1                                              /**< (DACC_CHER) Channel 1 Enable Position */
#define DACC_CHER_CH1_Msk                   (_U_(0x1) << DACC_CHER_CH1_Pos)                /**< (DACC_CHER) Channel 1 Enable Mask */
#define DACC_CHER_CH1                       DACC_CHER_CH1_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_CHER_CH1_Msk instead */
#define DACC_CHER_MASK                      _U_(0x03)                                      /**< \deprecated (DACC_CHER) Register MASK  (Use DACC_CHER_Msk instead)  */
#define DACC_CHER_Msk                       _U_(0x03)                                      /**< (DACC_CHER) Register Mask  */

#define DACC_CHER_CH_Pos                    0                                              /**< (DACC_CHER Position) Channel x Enable */
#define DACC_CHER_CH_Msk                    (_U_(0x3) << DACC_CHER_CH_Pos)                 /**< (DACC_CHER Mask) CH */
#define DACC_CHER_CH(value)                 (DACC_CHER_CH_Msk & ((value) << DACC_CHER_CH_Pos))  

/* -------- DACC_CHDR : (DACC Offset: 0x14) (/W 32) Channel Disable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CH0:1;                     /**< bit:      0  Channel 0 Disable                        */
    uint32_t CH1:1;                     /**< bit:      1  Channel 1 Disable                        */
    uint32_t :30;                       /**< bit:  2..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t CH:2;                      /**< bit:   0..1  Channel x Disable                        */
    uint32_t :30;                       /**< bit:  2..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} DACC_CHDR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DACC_CHDR_OFFSET                    (0x14)                                        /**<  (DACC_CHDR) Channel Disable Register  Offset */

#define DACC_CHDR_CH0_Pos                   0                                              /**< (DACC_CHDR) Channel 0 Disable Position */
#define DACC_CHDR_CH0_Msk                   (_U_(0x1) << DACC_CHDR_CH0_Pos)                /**< (DACC_CHDR) Channel 0 Disable Mask */
#define DACC_CHDR_CH0                       DACC_CHDR_CH0_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_CHDR_CH0_Msk instead */
#define DACC_CHDR_CH1_Pos                   1                                              /**< (DACC_CHDR) Channel 1 Disable Position */
#define DACC_CHDR_CH1_Msk                   (_U_(0x1) << DACC_CHDR_CH1_Pos)                /**< (DACC_CHDR) Channel 1 Disable Mask */
#define DACC_CHDR_CH1                       DACC_CHDR_CH1_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_CHDR_CH1_Msk instead */
#define DACC_CHDR_MASK                      _U_(0x03)                                      /**< \deprecated (DACC_CHDR) Register MASK  (Use DACC_CHDR_Msk instead)  */
#define DACC_CHDR_Msk                       _U_(0x03)                                      /**< (DACC_CHDR) Register Mask  */

#define DACC_CHDR_CH_Pos                    0                                              /**< (DACC_CHDR Position) Channel x Disable */
#define DACC_CHDR_CH_Msk                    (_U_(0x3) << DACC_CHDR_CH_Pos)                 /**< (DACC_CHDR Mask) CH */
#define DACC_CHDR_CH(value)                 (DACC_CHDR_CH_Msk & ((value) << DACC_CHDR_CH_Pos))  

/* -------- DACC_CHSR : (DACC Offset: 0x18) (R/ 32) Channel Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CH0:1;                     /**< bit:      0  Channel 0 Status                         */
    uint32_t CH1:1;                     /**< bit:      1  Channel 1 Status                         */
    uint32_t :6;                        /**< bit:   2..7  Reserved */
    uint32_t DACRDY0:1;                 /**< bit:      8  DAC Ready Flag                           */
    uint32_t DACRDY1:1;                 /**< bit:      9  DAC Ready Flag                           */
    uint32_t :22;                       /**< bit: 10..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t CH:2;                      /**< bit:   0..1  Channel x Status                         */
    uint32_t :6;                        /**< bit:   2..7  Reserved */
    uint32_t DACRDY:2;                  /**< bit:   8..9  DAC Ready Flag                           */
    uint32_t :22;                       /**< bit: 10..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} DACC_CHSR_Type;
