sapphireos/chromatron/src/hal/sams70/arm/sams70a/include/component/dacc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DACC_CHSR_OFFSET                    (0x18)                                        /**<  (DACC_CHSR) Channel Status Register  Offset */

#define DACC_CHSR_CH0_Pos                   0                                              /**< (DACC_CHSR) Channel 0 Status Position */
#define DACC_CHSR_CH0_Msk                   (_U_(0x1) << DACC_CHSR_CH0_Pos)                /**< (DACC_CHSR) Channel 0 Status Mask */
#define DACC_CHSR_CH0                       DACC_CHSR_CH0_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_CHSR_CH0_Msk instead */
#define DACC_CHSR_CH1_Pos                   1                                              /**< (DACC_CHSR) Channel 1 Status Position */
#define DACC_CHSR_CH1_Msk                   (_U_(0x1) << DACC_CHSR_CH1_Pos)                /**< (DACC_CHSR) Channel 1 Status Mask */
#define DACC_CHSR_CH1                       DACC_CHSR_CH1_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_CHSR_CH1_Msk instead */
#define DACC_CHSR_DACRDY0_Pos               8                                              /**< (DACC_CHSR) DAC Ready Flag Position */
#define DACC_CHSR_DACRDY0_Msk               (_U_(0x1) << DACC_CHSR_DACRDY0_Pos)            /**< (DACC_CHSR) DAC Ready Flag Mask */
#define DACC_CHSR_DACRDY0                   DACC_CHSR_DACRDY0_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_CHSR_DACRDY0_Msk instead */
#define DACC_CHSR_DACRDY1_Pos               9                                              /**< (DACC_CHSR) DAC Ready Flag Position */
#define DACC_CHSR_DACRDY1_Msk               (_U_(0x1) << DACC_CHSR_DACRDY1_Pos)            /**< (DACC_CHSR) DAC Ready Flag Mask */
#define DACC_CHSR_DACRDY1                   DACC_CHSR_DACRDY1_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_CHSR_DACRDY1_Msk instead */
#define DACC_CHSR_MASK                      _U_(0x303)                                     /**< \deprecated (DACC_CHSR) Register MASK  (Use DACC_CHSR_Msk instead)  */
#define DACC_CHSR_Msk                       _U_(0x303)                                     /**< (DACC_CHSR) Register Mask  */

#define DACC_CHSR_CH_Pos                    0                                              /**< (DACC_CHSR Position) Channel x Status */
#define DACC_CHSR_CH_Msk                    (_U_(0x3) << DACC_CHSR_CH_Pos)                 /**< (DACC_CHSR Mask) CH */
#define DACC_CHSR_CH(value)                 (DACC_CHSR_CH_Msk & ((value) << DACC_CHSR_CH_Pos))  
#define DACC_CHSR_DACRDY_Pos                8                                              /**< (DACC_CHSR Position) DAC Ready Flag */
#define DACC_CHSR_DACRDY_Msk                (_U_(0x3) << DACC_CHSR_DACRDY_Pos)             /**< (DACC_CHSR Mask) DACRDY */
#define DACC_CHSR_DACRDY(value)             (DACC_CHSR_DACRDY_Msk & ((value) << DACC_CHSR_DACRDY_Pos))  

/* -------- DACC_CDR : (DACC Offset: 0x1c) (/W 32) Conversion Data Register 0 -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t DATA0:16;                  /**< bit:  0..15  Data to Convert for channel 0            */
    uint32_t DATA1:16;                  /**< bit: 16..31  Data to Convert for channel 1            */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} DACC_CDR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DACC_CDR_OFFSET                     (0x1C)                                        /**<  (DACC_CDR) Conversion Data Register 0  Offset */

#define DACC_CDR_DATA0_Pos                  0                                              /**< (DACC_CDR) Data to Convert for channel 0 Position */
#define DACC_CDR_DATA0_Msk                  (_U_(0xFFFF) << DACC_CDR_DATA0_Pos)            /**< (DACC_CDR) Data to Convert for channel 0 Mask */
#define DACC_CDR_DATA0(value)               (DACC_CDR_DATA0_Msk & ((value) << DACC_CDR_DATA0_Pos))
#define DACC_CDR_DATA1_Pos                  16                                             /**< (DACC_CDR) Data to Convert for channel 1 Position */
#define DACC_CDR_DATA1_Msk                  (_U_(0xFFFF) << DACC_CDR_DATA1_Pos)            /**< (DACC_CDR) Data to Convert for channel 1 Mask */
#define DACC_CDR_DATA1(value)               (DACC_CDR_DATA1_Msk & ((value) << DACC_CDR_DATA1_Pos))
#define DACC_CDR_MASK                       _U_(0xFFFFFFFF)                                /**< \deprecated (DACC_CDR) Register MASK  (Use DACC_CDR_Msk instead)  */
#define DACC_CDR_Msk                        _U_(0xFFFFFFFF)                                /**< (DACC_CDR) Register Mask  */


/* -------- DACC_IER : (DACC Offset: 0x24) (/W 32) Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXRDY0:1;                  /**< bit:      0  Transmit Ready Interrupt Enable of channel 0 */
    uint32_t TXRDY1:1;                  /**< bit:      1  Transmit Ready Interrupt Enable of channel 1 */
    uint32_t :2;                        /**< bit:   2..3  Reserved */
    uint32_t EOC0:1;                    /**< bit:      4  End of Conversion Interrupt Enable of channel 0 */
    uint32_t EOC1:1;                    /**< bit:      5  End of Conversion Interrupt Enable of channel 1 */
    uint32_t :26;                       /**< bit:  6..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t TXRDY:2;                   /**< bit:   0..1  Transmit Ready Interrupt Enable of channel x */
    uint32_t :2;                        /**< bit:   2..3  Reserved */
    uint32_t EOC:2;                     /**< bit:   4..5  End of Conversion Interrupt Enable of channel x */
    uint32_t :26;                       /**< bit:  6..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} DACC_IER_Type;
